// http请求出错状态码
export const HTTP_ERROR: Record<number, string> = {
  400: '请求错误!',
  401: '登陆超时!',
  403: '拒绝访问!',
  404: '请求出错!',
  408: '请求超时!',
  500: '服务器错误!',
  501: '服务未实现!',
  502: '网络错误!',
  503: '服务不可用!',
  504: '网络超时!',
  505: 'HTTP版本不受支持!',
};
// 接口返回报错状态码
export const APP_ERROR: Record<number, string> = {
  400: '请求错误!',
  401: '登陆超时!',
  403: '拒绝访问!',
  404: '请求出错!',
  408: '请求超时!',
  500: '服务器错误!',
  501: '服务未实现!',
  502: '网络错误!',
  503: '服务不可用!',
  504: '网络超时!',
  505: 'HTTP版本不受支持!',
};
